reddit/app/models/user.rb

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Bs5SXqzbg-d-CyhyWKvH3Q"], ["updated_at", "2018-11-20 23:31:58.044011"], ["id", 1]]

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Leslie Knope"], ["LIMIT", 1]]