reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:id])

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit

    @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "weeeee"], ["updated_at", "2018-11-20 23:31:52.485654"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)